# 1. შექმენით მთელი რიცხვების მინიმუმ 5 ელემენტიანი სია, გამოთვალეთ ყველა რიცხვის ჯამი და საშუალო, არ გამოიყენოთ ჩაშენებული ფუნქციები!

# numbers = [1, 2, 3, 4, 5]
# total = 0
# avg = 0
#
# for i in numbers:
#     total += i
#     avg += 1
#
# avg = total / avg
#
# print(total)
# print(avg)




# 2. მოცემულია სია ['a', 'b', 2, 4, 2, 'c', 'j', 1, 'b', 'd', 'c', 4, 1], დაწერეთ ლოგიკა, როემლიც ამ ლისტში დატოვებს უნიკალურ
# ელემენტებს, ანუ არ განმეორდება ელემენტები. არ გამოიყენოთ set!

# list = ['a', 'b', 2, 4, 2, 'c', 'j', 1, 'b', 'd', 'c', 4, 1]
# def unique_list(list):
#     unique = []
#     for i in list:
#         if i not in unique:
#             unique.append(i)
#     return unique
# print(unique_list(list))




# 3. დააგენერირეთ 20 ელემენტიანი რიცხვების სია, რომელიც შევსებული იქნება -50 დან 50-მდე შემთხვევითი რიცხვებით და შექმენით მეორე
# სია, რომელიც პირველი სიიდან იქნება შევსებული მხოლოდ ლუწი რიცხვებით და დაბეჭდეთ ორივე სია, გამოიყენეთ აუცილებლად ლისტის გენერატორი!

# import random
#
# list1 = [random.randint(-50, 50) for i in range(20)]
# list2 = [i for i in list1 if i % 2 == 0]
#
# print(list1)
# print(list2)